app/Controllers/Sales.php

SELECT *
FROM `menu`
SELECT *
FROM `payment_types`
---
    public function index()
    {
        $menuModel = new MenuModel();
        $data['menus'] = $menuModel->findAll(); // Ambil semua data menu
        $paymentTypeModel = new PaymentTypeModel();
        $data = [
            'menus' => $menuModel->findAll(),
            'paymentTypes' => $paymentTypeModel->findAll(),

        ];

SELECT `sales`.*, `menu`.`menu_name`, `payment_types`.`payment_type_name`
FROM `sales`
JOIN `menu` ON `menu`.`menu_id` = `sales`.`menu_id`
JOIN `payment_types` ON `payment_types`.`payment_type_id` = `sales`.`payment_type_id`
WHERE DATE(sale_date) = '2024-11-27'
---
    public function getSales()
    {
        $salesModel = new SalesModel();

        // Ambil tanggal dari request, gunakan default hari ini jika kosong
        $date = $this->request->getPost('date') ?? date('Y-m-d');


        // Filter data penjualan berdasarkan tanggal
        $sales = $salesModel
        ->select('sales.*, menu.menu_name, payment_types.payment_type_name')
        ->join('menu', 'menu.menu_id = sales.menu_id')
        ->join('payment_types', 'payment_types.payment_type_id = sales.payment_type_id')
        ->where('DATE(sale_date)', $date)
        ->findAll();

SELECT SUM(quantity) as total_quantity, SUM(total_price) as total_sales
FROM `sales`
WHERE DATE(sale_date) = '2024-11-27'
 LIMIT 1
---
    public function getSalesSummary()
{
    $salesModel = new SalesModel();
    $date = $this->request->getPost('date') ?? date('Y-m-d'); // Default ke hari ini jika tanggal kosong

    $summary = $salesModel
        ->select('SUM(quantity) as total_quantity, SUM(total_price) as total_sales')
        ->where('DATE(sale_date)', $date)
        ->first();

SELECT *
FROM `menu`
WHERE `menu`.`menu_id` = '5'
INSERT INTO `sales` (`menu_id`, `quantity`, `total_price`, `payment_type_id`, `sale_date`) VALUES ('5', '12', 108000, '3', '2024-11-27T18:11')
---
public function save()
{
    $salesModel = new SalesModel();
    $menuId = $this->request->getPost('menu_id');
    $quantity = $this->request->getPost('quantity');
    $paymentType = $this->request->getPost('payment_type_id');
    $datetime = new \DateTime('now', new \DateTimeZone('Asia/Jakarta'));  // Pastikan menggunakan namespace global "\DateTime"
    $formattedDate = $datetime->format('Y-m-d\TH:i');
    $saleDate = $formattedDate; // Ambil tanggal dari input form

    // Jika tidak ada tanggal yang diberikan, gunakan tanggal saat ini
    if (empty($saleDate)) {
        $saleDate = date('Y-m-d H:i:s'); // Format default untuk MySQL DATETIME
    }

    // Dapatkan harga dari menu
    $menuModel = new MenuModel();
    $menu = $menuModel->find($menuId);
    $price = $menu['price'];

    $totalPrice = $quantity * $price;

    // Simpan ke database
    $salesModel->insert([
        'menu_id' => $menuId,
        'quantity' => $quantity,
        'total_price' => $totalPrice,
        'payment_type_id' => $paymentType,
        'sale_date' => $saleDate // Kirimkan tanggal yang diterima dari pengguna
    ]);